# AnalyticalModelBaseAlignmentMethod Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AnalyticalModelBaseAlignmentMethod Property
ParameterTypeId Class See Also
---
"Base Alignment Method"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AnalyticalModelBaseAlignmentMethod { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AnalyticalModelBaseAlignmentMethod As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AnalyticalModelBaseAlignmentMethod {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace